
#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

```terraform
aws_vpc.main: Refreshing state... [id=vpc-03416ec743afdead3]
aws_vpc.sub: Refreshing state... [id=vpc-0e6edc400c8f915fc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_vpc.new will be created
  + resource "aws_vpc" "new" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.1.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = (known after apply)
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags                           = {
          + "Name" = "vpc-handson-new"
        }
      + tags_all                       = {
          + "Name" = "vpc-handson-new"
        }
    }

  # aws_vpc.sub will be destroyed
  - resource "aws_vpc" "sub" {
      - arn                              = "arn:aws:ec2:ap-northeast-1:220689308637:vpc/vpc-0e6edc400c8f915fc" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.1.0.0/16" -> null
      - default_network_acl_id           = "acl-0a4be4bef4d9fc263" -> null
      - default_route_table_id           = "rtb-093ad67719c9c7016" -> null
      - default_security_group_id        = "sg-0b1212cb3a9bead0e" -> null
      - dhcp_options_id                  = "dopt-be6c7adc" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0e6edc400c8f915fc" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-093ad67719c9c7016" -> null
      - owner_id                         = "220689308637" -> null
      - tags                             = {
          - "Name" = "vpc-handson-test5"
        } -> null
      - tags_all                         = {
          - "Name" = "vpc-handson-test5"
        } -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>